Beep-Home/Matter-SensAir/sdkconfig.defaults.esp32s3
# General
CONFIG_IDF_TARGET="esp32s3"

# GPIO and Sensor
CONFIG_SENSOR_I2C_SDA_GPIO=35
CONFIG_SENSOR_I2C_SCL_GPIO=36
CONFIG_LED_GPIO=47
CONFIG_BUTTON_GPIO=0

# Bluetooth (NIMBLE)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# Network
CONFIG_LWIP_IPV6_AUTOCONFIG=y

# Thread
CONFIG_ENABLE_MATTER_OVER_THREAD=n

# LwIP
CONFIG_LWIP_IPV6_NUM_ADDRESSES=6